{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q219xg", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q219xg", "created_utc": 1767367204, "subreddit": "wallstreetbets", "title": "Weekly Earnings Thread 1/5 - 1/9", "selftext": "", "url": "https://i.redd.it/st2rova3eyag1.jpeg", "score": 44, "num_comments": 67, "upvote_ratio": 0.91, "author": "OSRSkarma", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q219xg/weekly_earnings_thread_15_19/", "flair": "Earnings Thread", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q41fao", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.25925925925925924}, "trend_score": 0.5308641975308641, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q41fao", "created_utc": 1767560256, "subreddit": "wallstreetbets", "title": "What Are Your Moves Tomorrow, January 05, 2026", "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1q41fao)", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q41fao/what_are_your_moves_tomorrow_january_05_2026/", "score": 74, "num_comments": 835, "upvote_ratio": 0.97, "author": "wsbapp", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q41fao/what_are_your_moves_tomorrow_january_05_2026/", "flair": "Daily Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q402c9", "window_s": 1800, "features": {"score_rate": 0.04938271604938271, "comment_rate": 0.0}, "trend_score": 0.04938271604938271, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q402c9", "created_utc": 1767557154, "subreddit": "wallstreetbets", "title": "Investing changed my life", "selftext": "The year was 2015. I was working a shit job as a housing consultant at a for profit automotive school. The job sucked but I had plenty of desk time and I used it to research tickers. I had been trading off an on since around 2010 but with only about 1k. I remember buying Macys, Hecla Mining, and bullshit penny stocks until I knew better. I was over trading like a mad man. This was even dumber then because they charged commission of about 7$ per trade during those days. Just young and dumb not really making any money. Wasting company time so no harm no foul. \n\nIn the beginning of 2015 I received an inheritance from an Aunt for 10k. Which was basically my life savings at that point in time. I could have very easily put this money up my nose but I was intrigued by investing after reading an article about Teslanairres (tsla investors who had made life changing money off shares that iPod around 20 bucks per)  During my many hours of researching companies I came across Nvidia. Here was a legacy gaming company that had exposure to many futuristic themes. A CEO that had been there since inception and came across as visionary (yes even at that time). I found his aspirations of self driving, AI , robotics and iot to be very disruptive compared to the current 2015 technology landscape. I began watching his interviews and was particularly interested with an early sit down with Elon Musk. I remember talking to my father in law about it. “What if I just plop the whole 10k down on Nvidia?”  Too many eggs in one basket was his response. I ended  up saying fuggit and doing it my way and in October 2015 I dropped the whole 10k into Nvidia. As I watched Nvidias ascent I realized I had found something on the ground floor an added to my position whenever I could. $200 every other paycheck until I got up to 500shares. \n\nIt has been a great ride since then. There have been ups and downs and moments of insane volatility that almost spooked me out of my shares. It definitely wasnt a straight arrow up and it took balls of steel\n\nto hold this long. So much bullshit -Crypto winter , Andrew Left short selling attacks, Covid selloffs, deepseek bullshit and most recently liberation day. I’m glad to say I stayed the course and only trimmed after massive runs and splits using the money to buy my house, cars, investment properties and drop the rest in a HYSA. Trading and more specifically, Nvidia, changed my entire life. Proudly riding with Jensen ", "url": "https://www.reddit.com/gallery/1q402c9", "score": 264, "num_comments": 62, "upvote_ratio": 0.9, "author": "HighlightFeeling4118", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q402c9/investing_changed_my_life/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q40khu", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.037037037037037035}, "trend_score": 0.08641975308641975, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q40khu", "created_utc": 1767558294, "subreddit": "wallstreetbets", "title": "Intel is about to make so much goddamn money", "selftext": "If you're looking for the hyperscaler big bottleneck of 2027/2028 to get ahead of, it's advanced packaging and high-NA EUV.\n\nTL;DR: Intel's 18A process is in production, 14A is on track to beat TSMC to High-NA EUV, TSMC's CoWoS packaging is sold out through 2027 and Intel has spare capacity (with Google confirmed as a buyer for TPU v8), FCF turned positive\n\n## 18A is already in volume manufacturing.\n\n* Panther Lake (laptop CPUs) ships January 2026.\n\n* Defect density dropped below 0.40/cm² and is still improving.\n\n* First process to combine RibbonFET (gate-all-around transistors) AND PowerVia (backside power delivery) in production.\n\n* Technically competitive with TSMC N2, which just started ramping.\n\nCES will be a nice early catalyst next week.\n\n## 14A: A real yolo play\n\n* 14A PDK already distributed to lead customers. Real production will ramp in 2027.\n* First node to use High-NA EUV lithography—TSMC's competing A14 isn't expected until 2028.\n* GF Securities research (December 2025): \"High likelihood that Nvidia and AMD server SKUs will use Intel 14A.\"\n\n## EMIB: Advanced packaging money printer\n\nTSMC's CoWoS advanced packaging is completely sold out through 2027. Nvidia has locked up over half the capacity. Google reportedly cut 2026 TPU production from 4M to 3M units because they couldn't get packaging slots.\nEnter Intel's EMIB (Embedded Multi-die Interconnect Bridge):\n\n* Uses silicon bridges instead of full interposers—cheaper, more flexible, better for inference chips and ASICs.\n* Intel scaling New Mexico packaging capacity: +30% EMIB, +150% Foveros.\n* Reports indicate AWS, MediaTek, Broadcom, and potentially Apple are exploring Intel packaging.\n* Intel can package TSMC-fabbed dies. You don't need to move your wafers to Intel to use their back-end.\n* Already leaked that Google is going to use EMIB for TPU v8\n\nThis is pure incremental revenue with minimal risk. The capacity exists, the tech is proven (shipping since 2017), and demand is there because TSMC literally cannot supply it\n\nPosition: \n\nLeveraged nana's inheritance for INTC 1/21/2028 C $37", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q40khu/intel_is_about_to_make_so_much_goddamn_money/", "score": 196, "num_comments": 131, "upvote_ratio": 0.83, "author": "typeomanic", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q40khu/intel_is_about_to_make_so_much_goddamn_money/", "flair": "DD", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q3wu1b", "window_s": 1800, "features": {"score_rate": 0.024691358024691357, "comment_rate": 0.0}, "trend_score": 0.024691358024691357, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q3wu1b", "created_utc": 1767549935, "subreddit": "wallstreetbets", "title": "Calendar year results.", "selftext": "\n\n\nI started self directing my retirement fund about a year and a half ago, but really started taking it seriously this year last year and it’s obviously a outlier year in terms of trends and valuations but pretty happy with the results of course.\n\nThe majority of it has been from rolling LEAPs of companies I have long term confidence in but my portfolio is a bit too all over the place for my liking right now so the plan for 2026 is to consolidate into a few larger long positions and leave a bit for a few gambles as I track a few sectors. Honestly the most enjoyable part of this year has been hunting around for good buys and doing the research. Turns out what I thought was boring and tedious is super fun when your analysis pays off, literally.\n\nI know it’s not sustainable for the next 30 years but I think I’ll certainly achieve better results than the 2.4% MER was paying for with my previous advisor and his basket of mutual funds.", "url": "https://www.reddit.com/gallery/1q3wu1b", "score": 119, "num_comments": 26, "upvote_ratio": 0.88, "author": "[deleted]", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q3wu1b/calendar_year_results/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q3fzm1", "window_s": 1800, "features": {"score_rate": 0.04938271604938271, "comment_rate": 0.0}, "trend_score": 0.04938271604938271, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q3fzm1", "created_utc": 1767499846, "subreddit": "wallstreetbets", "title": "I am almost back to where i started 6 years later.", "selftext": "If only I held my MU options from last year though…", "url": "https://www.reddit.com/gallery/1q3fzm1", "score": 431, "num_comments": 79, "upvote_ratio": 0.97, "author": "I-love-stonk", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q3fzm1/i_am_almost_back_to_where_i_started_6_years_later/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2u87p", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2u87p", "created_utc": 1767445731, "subreddit": "wallstreetbets", "title": "Why Papa John’s Pizza Benefits from the Venezuelan Regime Change", "selftext": "From the Venezuela invasion by US - I’ve used Google to see that orders at pizza places around the Pentagon have been surging.\n\nWe can see institutions frontrunning Pizza shops like Papa Johns (up 4%) today.\n\nHowever most importantly, Warren Buffet knew this all already and priced in the regime change by buying Dominos Pizza years ago. This is no surprise however, given his last Buffett last name that an expert in the food - special military operations trade.\n\nBecause of a second order effect of the US invasion of Venezuela, I‘ve discovered hidden data that pizza demand would increase significantly. \n\nTherefore Monday open, I plan to full port it Into Papa Johns Pizza which benefits from the most from the Venezuela regime change ", "url": "https://www.reddit.com/gallery/1q2u87p", "score": 1301, "num_comments": 66, "upvote_ratio": 0.96, "author": "AleaBito", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2u87p/why_papa_johns_pizza_benefits_from_the_venezuelan/", "flair": "YOLO", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2uyeg", "window_s": 1800, "features": {"score_rate": 0.024691358024691357, "comment_rate": 0.0}, "trend_score": 0.024691358024691357, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2uyeg", "created_utc": 1767447856, "subreddit": "wallstreetbets", "title": "BYD +5% after becoming world’s top EV seller with 2.26M units as Tesla deliveries fall 8.6% in 2025", "selftext": "Source: [https://www.cnn.com/2026/01/02/business/tesla-byd-ev](https://www.cnn.com/2026/01/02/business/tesla-byd-ev)\n\n>In 2011, Tesla CEO Elon Musk dismissed Chinese electric vehicle maker BYD as a competitor. But some 14 years later, BYD beat the American EV pioneer at its own game.\n\n>The Chinese car giant has overtaken Tesla as the world’s largest seller of EVs, according to 2025 data released by the two rivals this week.\n\n>BYD announced Thursday that it had sold 2.26 million EVs, up nearly 28% from 2024. Meanwhile, Tesla reported Friday a second straight year of declining sales: Deliveries fell 8.6% to only 1.6 million, recording the biggest annual drop in the company’s history.\n\n>BYD was able to overtake Tesla even though its EVs are not available for purchase in America, while China is Tesla’s second-largest market.\n\n>In the fourth quarter, Tesla’s sales came in at about 418,000, down 15.6% from a year earlier and an even sharper decline from record global sales in the third quarter, when American motorists were rushing to buy EVs before a $7,500 tax credit expired on October 1.\n\n>Unlike other automakers, Tesla does not report its sales by market, providing only global figures, but the US market is responsible for nearly half its revenue, according to company reports. Reports by other automakers Monday are also likely to show weak US EV sales in the final three months of 2025.\n\n>Tesla’s deliveries had grown nearly 50% a year at one point. But it reported its first drop in annual sales in 2024, posting a modest 1% decline. Its sales fell sharply in the first six months of 2025 as it faced more competition from the EV offerings of other automakers, such a BYD and legacy global automakers, as well as backlash against Musk’s political activities, which angered many potential American and European buyers.\n\n>Early in the year, when Musk was leading the Trump administration’s Department of Government Efficiency, there were regular protests outside Tesla showrooms in Europe and the United States, and some reports of vandalism against Tesla cars and sites.\n\n>The rush to take advantage of the soon-to-expire tax credit helped sales in the third quarter. But it likely brought forward purchases by some buyers who might have bought Teslas later in the year.\n\n>To try to counter the loss of the tax credit, Tesla rolled out cheaper versions of its Model 3 and Model Y cars, but those versions, while costing about $5,000 less than their “premium” equivalents, also won’t travel as far on a full charge as the premium versions and lack some features.\n\n>Aggressive competition\n\n>BYD achieved the latest milestone while grappling with fierce competition and relentless price wars in its home market. The intense \\_\\_ in China has prompted the Shenzhen-based company to expand further overseas, though its low-price strategy has drawn scrutiny and led to new tariffs in some markets.\n\n>Growth in BYD’s overall sales, including EVs and hybrids, slowed to its weakest pace in five years, with more than 4.6 million vehicles sold last year – underscoring the company’s struggles in China, the world’s largest automobile market and where BYD sells the bulk of its cars.\n\n>BYD also reported profit declines for both the second and third quarters of 2025.\n\n>While China’s auto market has become less crowded in the past few years, competition remains stiff with around 150 car brands and more than 50 EV makers, according to HSBC’s research. Rivals like Geely, China’s second-largest EV maker, fast-rising competitor Leapmotor and latecomer Xiaomi, which debuted its first EV only in 2024, have gradually eroded BYD’s domestic market share.\n\n>From a peak of 35% in 2023, BYD’s market share fell to 29% in the first 11 months of 2025, according to China Passenger Car Association. In the same period last year, its sales declined more than 5%, while Geely’s surged nearly 90%.\n\n>Wang Chuanfu, BYD’s founder and CEO, attributed the slowdown in domestic sales to erosion of BYD’s technological lead and insufficient product differentiation at a December investor meeting, according to state-run media. But he added that the company would soon unveil new technologies.\n\n>Shares of Tesla (TSLA) rose 1.2% in early trading Friday. Shares closed 2025 up 18.6% for the year, as investors looked past weak sales and focused on Musk’s plans for a fleet of robotaxis and an “army” of humanoid robots that he has promised to start building soon. But so far the rollout of Tesla’s robotaxi service has fallen well short of his promises, limited to two metropolitan areas, Austin, Texas, and San Francisco, rather than serving half of the US population as he had predicted it would by the year’s end\n\nhttps://preview.redd.it/y9xd397b25bg1.png?width=1580&format=png&auto=webp&s=1e3cba444c0ce8fa4be24f01140bb8a45c69e8ca\n\nhttps://preview.redd.it/3uxgersb25bg1.png?width=1589&format=png&auto=webp&s=81685925ef7f3f9b41e4afa85918d298f43d1d7e\n\n", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q2uyeg/byd_5_after_becoming_worlds_top_ev_seller_with/", "score": 262, "num_comments": 73, "upvote_ratio": 0.93, "author": "callsonreddit", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2uyeg/byd_5_after_becoming_worlds_top_ev_seller_with/", "flair": "News", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2injg", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2injg", "created_utc": 1767408065, "subreddit": "wallstreetbets", "title": "Closed SPXW $6875.00C 01/02/26 for $100,000.00 gain (+92%)", "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1q2injg)", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q2injg/closed_spxw_687500c_010226_for_10000000_gain_92/", "score": 826, "num_comments": 129, "upvote_ratio": 0.92, "author": "_bwhaley", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2injg/closed_spxw_687500c_010226_for_10000000_gain_92/", "flair": "Verified Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2yejl", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2yejl", "created_utc": 1767456588, "subreddit": "wallstreetbets", "title": "NIO vs RIVIAN", "selftext": "Rivian delivered 42,247 vehicles, down 18% year over year, while NIO delivered 326,028 vehicles, up 47% year over year. Despite this, Rivian’s market cap is about $24B, compared to NIO’s $11B. It is just because NIO is a Chinese company? ", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q2yejl/nio_vs_rivian/", "score": 34, "num_comments": 48, "upvote_ratio": 0.81, "author": "Warm_Grape_5677", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2yejl/nio_vs_rivian/", "flair": "Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q1zzaa", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q1zzaa", "created_utc": 1767364078, "subreddit": "wallstreetbets", "title": "Tesla's quarterly deliveries fall more than expected on lower EV demand", "selftext": "", "url": "https://www.reuters.com/business/autos-transportation/teslas-quarterly-deliveries-fall-more-than-expected-lower-ev-demand-2026-01-02/", "score": 1566, "num_comments": 272, "upvote_ratio": 0.96, "author": "toydan", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q1zzaa/teslas_quarterly_deliveries_fall_more_than/", "flair": "News", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2gocx", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2gocx", "created_utc": 1767402795, "subreddit": "wallstreetbets", "title": "First time? MSTR 7DTE position", "selftext": "I first bought bitcoin in 2014 by wiring $9,500 to a German bank, which forwarded to a Russian money laundering exchange (BTC-e) that was later seized by the US government. \n\nMy friend group in college very certainly spent at least today’s equivalent of 5-6 billion dollars on really good drugs from the Silk Road. \n\nThe last big crash I remember was from over 1k to around $200. \n\nBTC does crash and trade flat occasionally. But this isn’t what it feels like. This is what it feels like before everyone who sold freaks out that they can’t time crypto and buys back in all at once. ", "url": "https://i.redd.it/w7uucn6xb1bg1.jpeg", "score": 132, "num_comments": 99, "upvote_ratio": 0.86, "author": "Entreprenewbeur", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2gocx/first_time_mstr_7dte_position/", "flair": "Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2a326", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2a326", "created_utc": 1767386737, "subreddit": "wallstreetbets", "title": "A fresh start for 2026   hoping to leave all the bad vibes in 2025 behind", "selftext": "Just last month, I lost $70k in a single month, and it completely shook me. I can’t even imagine how to make that back. Ever since I started day trading SPX, the money seems to burn faster and faster\n\nFor the new year, I’m thinking of quitting day trading and sticking to steady ETFs and individual stocks that might be a better approach. Lately, I’ve also been looking into government bonds and investing in rare metals, hoping for some good returns\n\nIn the end, I see the market as a big wilderness. I need to set my own rules of the jungle and follow them strictly, without changing them on a whim. I hope my rules hold up in the market this year\n\nI just hope everyone has their own strategy and doesn’t get swayed by emotions or other people’s noise", "url": "https://i.redd.it/9dhpqbz200bg1.jpeg", "score": 284, "num_comments": 110, "upvote_ratio": 0.95, "author": "Fortune756", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2a326/a_fresh_start_for_2026_hoping_to_leave_all_the/", "flair": "Loss", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2ae92", "window_s": 1800, "features": {"score_rate": 0.06172839506172839, "comment_rate": 0.0}, "trend_score": 0.06172839506172839, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2ae92", "created_utc": 1767387452, "subreddit": "wallstreetbets", "title": "Weekend Discussion Thread for the Weekend of January 02, 2026", "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1q2ae92)", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q2ae92/weekend_discussion_thread_for_the_weekend_of/", "score": 192, "num_comments": 15874, "upvote_ratio": 0.94, "author": "wsbapp", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2ae92/weekend_discussion_thread_for_the_weekend_of/", "flair": "Weekend Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q21xv0", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q21xv0", "created_utc": 1767368734, "subreddit": "wallstreetbets", "title": "NBIS 230K YOLO", "selftext": "https://preview.redd.it/qbeujqj3iyag1.png?width=1360&format=png&auto=webp&s=81abce2e3057b2b01aeadc1b0a432e05dc982ce3\n\nDo I know what they do? Nope.  \nWhy did I buy it then? I saw it on WSB 2026 stock picks and my lucky number is 5", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q21xv0/nbis_230k_yolo/", "score": 287, "num_comments": 68, "upvote_ratio": 0.94, "author": "NotABat", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q21xv0/nbis_230k_yolo/", "flair": "YOLO", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2dvd7", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2dvd7", "created_utc": 1767395678, "subreddit": "wallstreetbets", "title": "Micron Gainz", "selftext": "\\+ I sold 300 shares after earnings for 20K profit. I almost did this call spread for 100k before earnings, would have been a \\~10x now. I ended up buying the shares before earnings and the call spread afterwards. Meant to do 100k but was waiting for a dip that never came. ", "url": "https://i.redd.it/vsxvv510q0bg1.png", "score": 74, "num_comments": 30, "upvote_ratio": 0.93, "author": "bernielootz2nd", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2dvd7/micron_gainz/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q21bl6", "window_s": 1800, "features": {"score_rate": 0.04938271604938271, "comment_rate": 0.0}, "trend_score": 0.04938271604938271, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q21bl6", "created_utc": 1767367313, "subreddit": "wallstreetbets", "title": "$MRNA 2300 buys at $32 calls", "selftext": "Up 160% for Moderna! I decided to all in on the cheap options ", "url": "https://i.redd.it/n22ol1xeeyag1.jpeg", "score": 215, "num_comments": 41, "upvote_ratio": 0.97, "author": "kngan4397", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q21bl6/mrna_2300_buys_at_32_calls/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q21zst", "window_s": 1800, "features": {"score_rate": 0.06172839506172839, "comment_rate": 0.0}, "trend_score": 0.06172839506172839, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q21zst", "created_utc": 1767368853, "subreddit": "wallstreetbets", "title": "Micron gain pt25", "selftext": "20k on one contract    where are the micron soldiers at? somebody else must have calls ", "url": "https://i.redd.it/2uvp5hqsiyag1.jpeg", "score": 114, "num_comments": 12, "upvote_ratio": 0.93, "author": "HighlightFeeling4118", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q21zst/micron_gain_pt25/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q1q5jv", "window_s": 1800, "features": {"score_rate": 0.024691358024691357, "comment_rate": 0.0}, "trend_score": 0.024691358024691357, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q1q5jv", "created_utc": 1767331447, "subreddit": "wallstreetbets", "title": "The Santa Rally was 🔥", "selftext": "Special Thanks to NBIS!!!", "url": "https://i.redd.it/rqasw6hofvag1.png", "score": 744, "num_comments": 70, "upvote_ratio": 0.97, "author": "Fancy_Cattle_5914", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q1q5jv/the_santa_rally_was/", "flair": "Meme", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q250fg", "window_s": 1800, "features": {"score_rate": 0.06172839506172839, "comment_rate": 0.0}, "trend_score": 0.06172839506172839, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q250fg", "created_utc": 1767375495, "subreddit": "wallstreetbets", "title": "$BULL position", "selftext": "I’ll give y’all an update later this year… wish me luck ", "url": "https://i.redd.it/fkk9sbuq2zag1.jpeg", "score": 58, "num_comments": 26, "upvote_ratio": 0.91, "author": "Mayorofbooty", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q250fg/bull_position/", "flair": "YOLO", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q2936h", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2936h", "created_utc": 1767384430, "subreddit": "wallstreetbets", "title": "Micron (MU) Gains", "selftext": "[Overview of the trade before closing the position](https://preview.redd.it/eruepj4xrzag1.jpg?width=1003&format=pjpg&auto=webp&s=e5c3de2a8d41964078faeec1983d5dc4962a192f)\n\n[First buy order](https://preview.redd.it/9ludsj4xrzag1.jpg?width=1003&format=pjpg&auto=webp&s=64fcb4c0117ffdfd3068de0843fa8a3fc7845f72)\n\n[Second buy order](https://preview.redd.it/72cafk4xrzag1.jpg?width=1003&format=pjpg&auto=webp&s=6e9a601150c05a14fd4bc1e674f44561dc5cf0e2)\n\n[Finally selling and closing my positions](https://preview.redd.it/5ckqmk4xrzag1.jpg?width=1003&format=pjpg&auto=webp&s=bfca610d9c021df4245e08d748c42bf83c779dfd)\n\n  \nHello everyone, just wanted to share with you all some gain porn I got from Micron. Excuse the language on the broker, I'm just a gambling addict from Turkey. I bought 3 call contracts on Micron that were 7 months out till expiration right before earnings and I happened to be correct about the company's performance. Not exactly an earnings play, I was actually planning to hold these longer, but especially after Micron's huge gains today, I couldn't help but want to secure my profits first before thinking about what to do next. I'm currently thinking maybe I'll buy ATM call options 6 months out on WDC, which is another company in a similar situation as Micron anyways tbh, and then hodl those for the next 3 months and see where this goes.", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q2936h/micron_mu_gains/", "score": 38, "num_comments": 18, "upvote_ratio": 0.84, "author": "tugrulthelol", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2936h/micron_mu_gains/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q16xyd", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q16xyd", "created_utc": 1767281851, "subreddit": "wallstreetbets", "title": "Total 750K into 2800 , hopefully I will recover soon and this year changes something for me . Happy new year guys", "selftext": "", "url": "https://i.redd.it/2z7ql0kacrag1.jpeg", "score": 2048, "num_comments": 345, "upvote_ratio": 0.96, "author": "Consistent-Buy8433", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q16xyd/total_750k_into_2800_hopefully_i_will_recover/", "flair": "Loss", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "wallstreetbets:1q1aqe9", "window_s": 1800, "features": {"score_rate": 0.06172839506172839, "comment_rate": 0.0}, "trend_score": 0.06172839506172839, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q1aqe9", "created_utc": 1767291177, "subreddit": "wallstreetbets", "title": "RKLB made me a millionaire", "selftext": "2025 was the year I hit $1M net worth.\n\n\nAbout $700k of that is RKLB (already discounted 10% from ATH so don’t @ me).\n\n\nBig shoutout to yall degens. This is where I learned about VACQ pre-RKLB and because of that I stacked 10k shares between Aug 2021 and Apr 2024.\n\n\nThe rest is boomer stuff: QQQM, VOO, NVDA. I’m up about 1100% on NVDA, though I sold a decent chunk to buy more RKLB years ago. Also started nibbling KRKNF in the last month.\n\n\nMy point is, if you actually read and think instead of just shitposting, there are some legit gems here.\n\n\nHappy New Year.\n\n\nNow give me my fkn flair: “See you, space cowboy…”\n\n\nRKLB $9000 LET’S RIDE 🚀", "url": "https://www.reddit.com/gallery/1q1aqe9", "score": 1121, "num_comments": 194, "upvote_ratio": 0.94, "author": "1foxyboi", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q1aqe9/rklb_made_me_a_millionaire/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q33k1v", "window_s": 1800, "features": {"score_rate": 0.08641975308641975, "comment_rate": 0.0}, "trend_score": 0.08641975308641975, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q33k1v", "created_utc": 1767468302, "subreddit": "stocks", "title": "With the US hitting Venezuela today, is anyone else terrified China takes Taiwan next? (and bricks the global chip supply)", "selftext": "Everyone is focused on Caracas right now, but I can’t stop thinking about the precedent this sets. If Beijing decides this is their green light to finally move on Taiwan, we aren’t looking at a chip shortage.\n\nPeople seem to forget the silicon shield failsafes. ASML has remote kill switches for their machines, and Taiwan has practically confirmed they would scorch-earth the TSMC foundries before letting the PLA take them intact.\n\nIf that happens, 90% of advanced chips don't just get expensive, they vanish. Overnight.\n\nWe’re talking about a total freeze on everything from new iPhones to Nvidia AI chips for at least 2-3 years while the US tries to spin up domestic fabs.\n\nWill the market even price this in? Feels like we are one bad decision away from the tech stone age.", "url": "https://www.reddit.com/r/stocks/comments/1q33k1v/with_the_us_hitting_venezuela_today_is_anyone/", "score": 3966, "num_comments": 1196, "upvote_ratio": 0.86, "author": "Orcanius", "permalink": "https://www.reddit.com/r/stocks/comments/1q33k1v/with_the_us_hitting_venezuela_today_is_anyone/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q2rkf2", "window_s": 1800, "features": {"score_rate": 0.0, "comment_rate": 0.012345679012345678}, "trend_score": 0.024691358024691357, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2rkf2", "created_utc": 1767436804, "subreddit": "stocks", "title": "What are some high risk high reward picks for 2026?", "selftext": "In your guys opinion, what are some high risk high reward picks for 2026, which have a potential to do a massive run up if the company is able to pull it off or do a massive dump if they dont. \n\nI see Poet being mentioned a lot, but i dont quite understand how they will pull it off.", "url": "https://www.reddit.com/r/stocks/comments/1q2rkf2/what_are_some_high_risk_high_reward_picks_for_2026/", "score": 108, "num_comments": 244, "upvote_ratio": 0.91, "author": "AloneStaff5051", "permalink": "https://www.reddit.com/r/stocks/comments/1q2rkf2/what_are_some_high_risk_high_reward_picks_for_2026/", "flair": "Industry Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q2hm4s", "window_s": 1800, "features": {"score_rate": 0.037037037037037035, "comment_rate": 0.0}, "trend_score": 0.037037037037037035, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2hm4s", "created_utc": 1767405264, "subreddit": "stocks", "title": "Here are my predictions for Monday (01/05/26)", "selftext": "There will be a post asking if MU can go higher.\n\nThere will be a post mentioning that the valuations are ridiculously high and that we are, in fact, in a bubble of epic bubbly proportions. \n\nThere will be a post where the user is going to be quite confused and distraught. About the current valuation of TSLA. Because it simply makes no sense. The confusion will be so palpable that one may wonder why the user didn't just use chatgpt or Gemini to answer the question quicker. In turn showing that perhaps LLMs are, in fact, a bubble. Because while the user had access to a quick answer, they chose not to use it. Stupid circular money.\n\nThere seems to be an uptick in the number of posts about Satya Nadella talking about AI slop. I see that being woven into bubble narrative quite soon here in the investing subreddits.\n\nWell, that about sums up my predictions for posts on Reddit for this coming Monday. What are yours?", "url": "https://www.reddit.com/r/stocks/comments/1q2hm4s/here_are_my_predictions_for_monday_010526/", "score": 131, "num_comments": 40, "upvote_ratio": 0.84, "author": "diablo1086", "permalink": "https://www.reddit.com/r/stocks/comments/1q2hm4s/here_are_my_predictions_for_monday_010526/", "flair": "Crystal Ball Post", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q39jku", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q39jku", "created_utc": 1767482636, "subreddit": "stocks", "title": "Euro hedged sp500", "selftext": "Basically the title. Since Trump wants to devalue the dollar. Would it not be better to be euro hedging the sp500 if i live in europe?\n\nWith everything going on in the world im a bit unsure to do right now. I know that in the long term this should even out (hopefully?). But yeah nowadays things are moving in all kinds of crazy directions. I’m not saying that the euro is a better currency than the dollar btw.", "url": "https://www.reddit.com/r/stocks/comments/1q39jku/euro_hedged_sp500/", "score": 1, "num_comments": 57, "upvote_ratio": 0.51, "author": "thd-ai", "permalink": "https://www.reddit.com/r/stocks/comments/1q39jku/euro_hedged_sp500/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q2z2cn", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q2z2cn", "created_utc": 1767458127, "subreddit": "stocks", "title": "Rate my picks", "selftext": "Ran a scan earlier in the week in hopes to find individual value stocks to buy and hold. Smallish exposure, goal is to have 25% of portfolio these picks and the other 75% VOO. \n\nScan criteria is as follows:\nReasonable share price vs book value (except MU, I’m willing to pay a higher ratio here for tech)\n\nMust haves:\nCurrent EPS growth higher than 5 yr avg\n\nPositive P/E\n\nCurrent revenue growth higher than 5 yr avg\n\nReturn on equity growth higher than 5 yr avg\n\n\nHere are the companies I’ve chosen so far:\n\nNBN - financial exposure with strong recent earnings growth and relatively low p/e compared to industry average.\n\nOHI - real estate exposure with strong EPS, Revenue, and ROE growth while staying at 5 yr P/E avg. I also firmly believe long term care will continue to have strong demand in the future.\n\nMU - tech exposure with absurd EPS, Revenue, and ROE growth. Current P/E of 27x is only about 2 times its 5 yr avg and is significantly lower than the industry average of 37-47x. I believe RAM is the bottleneck for AI development at the moment and MU is set up to benefit greatly as I believe it’s undervalued significantly.\n\nUHS - healthcare exposure, good earnings growth, low p/e. I think there’s still a stigma in the United States about mental health currently and opinions will change as people realize how important it is.\n\nI’m looking to add an Energy and Materials pick to this list in the near future. Let me know what you think!", "url": "https://www.reddit.com/r/stocks/comments/1q2z2cn/rate_my_picks/", "score": 3, "num_comments": 3, "upvote_ratio": 0.6, "author": "ipeench_", "permalink": "https://www.reddit.com/r/stocks/comments/1q2z2cn/rate_my_picks/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q20ehc", "window_s": 1800, "features": {"score_rate": 0.04938271604938271, "comment_rate": 0.0}, "trend_score": 0.04938271604938271, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q20ehc", "created_utc": 1767365118, "subreddit": "stocks", "title": "Micron just hit a new all time high momentum or fundamentals driving this?", "selftext": "First trading day of 2026 and Micron just hit a new all-time high. Considering how brutal past memory cycles have been, that’s pretty impressive.\n\n\n\nCurious how others are looking at this  is the market mainly pricing in stronger pricing power and AI driven demand finally showing up in earnings, or are we getting a bit ahead of ourselves here?", "url": "https://www.reddit.com/r/stocks/comments/1q20ehc/micron_just_hit_a_new_all_time_high_momentum_or/", "score": 56, "num_comments": 73, "upvote_ratio": 0.87, "author": "DefiantTell8233", "permalink": "https://www.reddit.com/r/stocks/comments/1q20ehc/micron_just_hit_a_new_all_time_high_momentum_or/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q1w1x1", "window_s": 1800, "features": {"score_rate": 0.06172839506172839, "comment_rate": 0.0}, "trend_score": 0.06172839506172839, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q1w1x1", "created_utc": 1767352489, "subreddit": "stocks", "title": "Building a 10 Stock Portfolio for the Long Run What Would You Pick?", "selftext": "I’m building a long-term individual stock portfolio for 2026 and beyond, and I want to narrow my focus to 10 high-quality companies I can hold for long term + 10 years\n\nBelow is a list of stocks I’m currently considering, covering a mix of large-cap tech, growth, fintech, healthcare, AI, and speculative plays I’m comfortable taking on more risk in exchange for higher long-term growth potential.\n\nFrom this list, which 10 stocks would you choose for a long-term portfolio, and why?\n\nEdit: It seems no one wants to waste time, so I’ll make it easier: choose only 5 stocks from the current list.\n\nAmazon\n\nMeta\n\nNetflix\n\nDISNEY\n\nAVGO\n\nOracle\n\nUber\n\nVISA\n\nADOBE\n\nPayPal\n\nELF\n\nCRWV\n\nNBIS\n\nBMNR\n\nHims\n\nOSCR\n\nEOSE\n\nBULL\n\nCIFR\n\nHIVE\n\nFOUR\n\nPagaya\n\nTTD\n\nACHR\n\nDUOLINGO\n\nDLO\n\nRR\n\nFOUR", "url": "https://www.reddit.com/r/stocks/comments/1q1w1x1/building_a_10_stock_portfolio_for_the_long_run/", "score": 46, "num_comments": 181, "upvote_ratio": 0.69, "author": "Used_Rice9332", "permalink": "https://www.reddit.com/r/stocks/comments/1q1w1x1/building_a_10_stock_portfolio_for_the_long_run/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q29sch", "window_s": 1800, "features": {"score_rate": 0.012345679012345678, "comment_rate": 0.0}, "trend_score": 0.012345679012345678, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q29sch", "created_utc": 1767386040, "subreddit": "stocks", "title": "$SMR up sharply today  looks more like a sector move than a company story", "selftext": "SMR (NuScale Power) is having a strong day, but unless I missed something, there’s no obvious company specific catalyst behind the move.\n\nThis looks more like a broader nuclear sector rotation than a sudden fundamental re rating of SMR itself.\n\nA few quick thoughts:\n\nThe nuclear theme keeps coming back  AI, data centers, and grid reliability all support the long term narrative.\n\nSMR is still early stage, with long timelines and real execution risk.\n\nHistorically, SMR tends to move fast when sentiment turns, and cool off just as quickly.\n\nNot saying today’s move is wrong  just that it feels sentiment driven rather than fundamentals driven.\n\nCurious how others here are thinking about it:\n\nLong nuclear as a long term infrastructure play, or just trading the volatility?\n\nIf you want exposure, do you prefer SMR, or broader plays like uranium miners / ETFs?\n\nInterested to hear different views.", "url": "https://www.reddit.com/r/stocks/comments/1q29sch/smr_up_sharply_today_looks_more_like_a_sector/", "score": 5, "num_comments": 5, "upvote_ratio": 0.78, "author": "One_Affectp", "permalink": "https://www.reddit.com/r/stocks/comments/1q29sch/smr_up_sharply_today_looks_more_like_a_sector/", "flair": "Industry Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564489", "candidate": {"key": "stocks:1q20cpy", "window_s": 1800, "features": {"score_rate": 0.024691358024691357, "comment_rate": 0.0}, "trend_score": 0.024691358024691357, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564489, "post": {"id": "1q20cpy", "created_utc": 1767364997, "subreddit": "stocks", "title": "TSM is hitting new highs", "selftext": "Toward the end of last year, I brought up a question here: was TSM being undervalued because of geopolitical risk, or had the market already priced that risk in pretty fairly?\n\nIt sparked some really good discussions at the time. Fast forward to today, and TSM just hit another all-time high at $316.\n\nI still think the geopolitical risk around Taiwan hasn’t gone away it’s a real factor in TSM’s valuation. So here’s another way to think about it: if that risk were ever meaningfully reduced or removed, how much higher could TSM’s valuation actually go?", "url": "https://www.reddit.com/r/stocks/comments/1q20cpy/tsm_is_hitting_new_highs/", "score": 14, "num_comments": 21, "upvote_ratio": 0.75, "author": "Own-Rise-9328", "permalink": "https://www.reddit.com/r/stocks/comments/1q20cpy/tsm_is_hitting_new_highs/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564537}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q41fao", "window_s": 1800, "features": {"score_rate": 0.0, "comment_rate": 0.23529411764705882}, "trend_score": 0.47058823529411764, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q41fao", "created_utc": 1767560256, "subreddit": "wallstreetbets", "title": "What Are Your Moves Tomorrow, January 05, 2026", "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1q41fao)", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q41fao/what_are_your_moves_tomorrow_january_05_2026/", "score": 74, "num_comments": 851, "upvote_ratio": 0.97, "author": "wsbapp", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q41fao/what_are_your_moves_tomorrow_january_05_2026/", "flair": "Daily Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q402c9", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q402c9", "created_utc": 1767557154, "subreddit": "wallstreetbets", "title": "Investing changed my life", "selftext": "The year was 2015. I was working a shit job as a housing consultant at a for profit automotive school. The job sucked but I had plenty of desk time and I used it to research tickers. I had been trading off an on since around 2010 but with only about 1k. I remember buying Macys, Hecla Mining, and bullshit penny stocks until I knew better. I was over trading like a mad man. This was even dumber then because they charged commission of about 7$ per trade during those days. Just young and dumb not really making any money. Wasting company time so no harm no foul. \n\nIn the beginning of 2015 I received an inheritance from an Aunt for 10k. Which was basically my life savings at that point in time. I could have very easily put this money up my nose but I was intrigued by investing after reading an article about Teslanairres (tsla investors who had made life changing money off shares that iPod around 20 bucks per)  During my many hours of researching companies I came across Nvidia. Here was a legacy gaming company that had exposure to many futuristic themes. A CEO that had been there since inception and came across as visionary (yes even at that time). I found his aspirations of self driving, AI , robotics and iot to be very disruptive compared to the current 2015 technology landscape. I began watching his interviews and was particularly interested with an early sit down with Elon Musk. I remember talking to my father in law about it. “What if I just plop the whole 10k down on Nvidia?”  Too many eggs in one basket was his response. I ended  up saying fuggit and doing it my way and in October 2015 I dropped the whole 10k into Nvidia. As I watched Nvidias ascent I realized I had found something on the ground floor an added to my position whenever I could. $200 every other paycheck until I got up to 500shares. \n\nIt has been a great ride since then. There have been ups and downs and moments of insane volatility that almost spooked me out of my shares. It definitely wasnt a straight arrow up and it took balls of steel\n\nto hold this long. So much bullshit -Crypto winter , Andrew Left short selling attacks, Covid selloffs, deepseek bullshit and most recently liberation day. I’m glad to say I stayed the course and only trimmed after massive runs and splits using the money to buy my house, cars, investment properties and drop the rest in a HYSA. Trading and more specifically, Nvidia, changed my entire life. Proudly riding with Jensen ", "url": "https://www.reddit.com/gallery/1q402c9", "score": 265, "num_comments": 62, "upvote_ratio": 0.9, "author": "HighlightFeeling4118", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q402c9/investing_changed_my_life/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2xli2", "window_s": 1800, "features": {"score_rate": 0.04411764705882353, "comment_rate": 0.0}, "trend_score": 0.04411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2xli2", "created_utc": 1767454684, "subreddit": "wallstreetbets", "title": "US attacks Venezuela?", "selftext": "", "url": "https://i.redd.it/4inm0vs7m5bg1.jpeg", "score": 12903, "num_comments": 556, "upvote_ratio": 0.96, "author": "stupidber", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2xli2/us_attacks_venezuela/", "flair": "Meme", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q3s1kk", "window_s": 1800, "features": {"score_rate": 0.058823529411764705, "comment_rate": 0.0}, "trend_score": 0.058823529411764705, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q3s1kk", "created_utc": 1767538881, "subreddit": "wallstreetbets", "title": "How cooked I am?", "selftext": "I did the brilliant idea of selling 4 CC on Iren last week, thinking BTC was gonna keep tanking. Im on margin and I was worried if Iren goes to $30, which it didnt. I still own like 300 shares at $17-$18. But i bought a lot in the 50-60.\n\nI still think iren goes to 100 this year\n\nLet them get called, roll them or pay to buy it ?", "url": "https://i.redd.it/uxuuvrpkkcbg1.jpeg", "score": 50, "num_comments": 58, "upvote_ratio": 0.78, "author": "Terrible_Bison_5052", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q3s1kk/how_cooked_i_am/", "flair": "Loss", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2w01j", "window_s": 1800, "features": {"score_rate": 0.020134228187919462, "comment_rate": 0.0}, "trend_score": 0.020134228187919462, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2w01j", "created_utc": 1767450713, "subreddit": "wallstreetbets", "title": "The Venezuela lesson: invest in energy security NOT cheap supply - The incoming commodity bull run (uranium, rare earths, precious metals).", "selftext": "My investment thesis is straightforward: over the next decade, markets will increasingly reward secure, politically aligned supply chains, not simply the lowest-cost producers. Energy security and strategic materials are becoming matters of national policy, and when that happens, pricing, capital flows, and valuations change structurally.\n\nThat’s why I’m concentrated in uranium and rare earth companies that sit outside China and inside Western-aligned supply chains.\n\nMy core holdings are Energy Fuels (UUUU), Cameco (CCJ), Centrus Energy (LEU), MP Materials (MP), and Lynas (LYSDY). $300k USD invested.\n\nI chose these US/US allied companies because they represent critical choke points in supply chains that the United States and the West utilities cannot easily replace. Together, they cover uranium mining, nuclear fuel conversion and enrichment, and rare earth production and processing outside of China. China controls the majority of these rare earths and, following Venezeula, supply restrictions are only going to get worse. We’re in the hoarding era….\n\nThe recent events in Venezuela are mostly being discussed as an oil story, but I think that framing misses the larger signal. Whether oil supply increases or not is secondary. The more important takeaway is geopolitical: the United States has shown it is willing to act decisively when strategic interests are involved. That reinforces a world where energy, materials, and supply chains are increasingly treated as matters of security rather than free-market commodities.\n\nImportantly, Venezuela does not pose an oversupply risk to uranium or rare earths. These markets are nothing like oil. Uranium is heavily regulated and sold primarily through long-term contracts with utilities that plan fuel needs years in advance. Rare earths require not just mining, but complex processing infrastructure that takes a decade or more to develop. There is no mechanism for sudden supply flooding in either market.\n\nHistory supports this view. During the 2006–2007 uranium bull run, prices did not rise because of speculative demand alone. They rose because utilities realized they were under-contracted in a tightening market and rushed to secure long-term supply. Once utilities began competing for material, prices moved violently and quickly, and equities re-rated far beyond what traditional valuation models anticipated. Rare earths experienced a similar dynamic a few years later when export controls and geopolitical tension exposed how fragile global supply really was. I expect a very similar situation to take place between 2026-2028. After Venezuela, the last thing China will do is flood the market with their supply leading to a supply constraint that will enable rare earths and uranium to Sky-rocket. Just look at how commodities reacted yesterday…\n\nThose episodes weren’t driven by economic growth cycles — they were driven by procurement crises. When utilities and governments fear supply disruption, they don’t negotiate for the best price; they secure supply at almost any price.\n\nThat historical lesson matters today. Nuclear power is expanding globally, enrichment capacity is constrained, and non-China rare earth supply remains limited. At the same time, geopolitical risk is rising, not falling. If tensions escalate further — particularly around Taiwan — the immediate market reaction would likely be risk-off across all assets. But the second-order effect would be a rapid acceleration of industrial policy, subsidies, and long-term contracts favoring Western-aligned suppliers of uranium and strategic materials.\n\nI’m not positioned for a short-term commodity spike. I’m positioned for a world where governments and utilities prioritize certainty of supply over cost, just as they did in prior cycles. In those environments, uranium and rare earth equities don’t behave like normal commodities — they behave like strategic infrastructure.\n\nThat’s the bet.\n\nTLDR: Geopolitical fragmentation turns uranium and rare earths into strategic assets; history shows these markets don’t reprice gradually - they reprice violently when supply security is questioned.\n\nEdit: TRUMP on LIVE NATIONAL TELEVISION JUST ANNOUNCED THEY ARE RUNNING THE COUNTRY. MOTHERFUCKING COMMODITY SEASON BABY!!!", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q2w01j/the_venezuela_lesson_invest_in_energy_security/", "score": 2040, "num_comments": 308, "upvote_ratio": 0.91, "author": "nickman23", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2w01j/the_venezuela_lesson_invest_in_energy_security/", "flair": "Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2lunb", "window_s": 1800, "features": {"score_rate": 0.04411764705882353, "comment_rate": 0.014705882352941176}, "trend_score": 0.07352941176470588, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2lunb", "created_utc": 1767417010, "subreddit": "wallstreetbets", "title": "How do I tell my wife I turned 100k to 21k?", "selftext": "She’s been having promotion meetings with her boss every 2 weeks so I dont want to kill the mood ", "url": "https://www.reddit.com/gallery/1q2lunb", "score": 14641, "num_comments": 3512, "upvote_ratio": 0.88, "author": "PPhunt3r", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2lunb/how_do_i_tell_my_wife_i_turned_100k_to_21k/", "flair": "Loss", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q30yzr", "window_s": 1800, "features": {"score_rate": 0.10294117647058823, "comment_rate": 0.0}, "trend_score": 0.10294117647058823, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q30yzr", "created_utc": 1767462471, "subreddit": "wallstreetbets", "title": "2025 was space and AI, 2026 is too", "selftext": "2025 was a roller coaster of good and bad decisions. Going to be more level headed in 2026 so my heart doesn’t palpitate as much.\n\nI saw a comment elsewhere about the WSB ETF picks for 2026 and honestly… they’re solid picks.\n\nThese will be more core holdings in 2026:\n- RKLB\n- ASTS\n- NBIS\n- PL\n- ONDS\n- POET\n- IREN\n- OPEN\n- LUNR (until LTV contract announced)\n- SLS (until final readout/analysis, hopefully acquisition)\n\nThese all look like meme stocks, I know. But most of these are solid earlier stage companies doing exciting things in their industry with good leadership teams.\n\nI think 2026 will be big. Tendies please 💸", "url": "https://www.reddit.com/gallery/1q30yzr", "score": 496, "num_comments": 123, "upvote_ratio": 0.95, "author": "winter-shoulders", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q30yzr/2025_was_space_and_ai_2026_is_too/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2x6cq", "window_s": 1800, "features": {"score_rate": 0.058823529411764705, "comment_rate": 0.0}, "trend_score": 0.058823529411764705, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2x6cq", "created_utc": 1767453670, "subreddit": "wallstreetbets", "title": "YOLO’d my whole account on naked SPX calls", "selftext": "SHITTING BRICKS right now", "url": "https://imgur.com/a/DCKEBVP", "score": 76, "num_comments": 130, "upvote_ratio": 0.74, "author": "whoscruffylookin", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2x6cq/yolod_my_whole_account_on_naked_spx_calls/", "flair": "YOLO", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q302oa", "window_s": 1800, "features": {"score_rate": 0.04411764705882353, "comment_rate": 0.0}, "trend_score": 0.04411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q302oa", "created_utc": 1767460414, "subreddit": "wallstreetbets", "title": "Take-Two Interactive Discussion", "selftext": "I invested approximately $1,200 in Take-Two Interactive (proof posted above) following the ~10% drop after the announcement of the GTA VI delay. I believe GTA VI has the potential to be the largest media release of the decade.\n\nGiven the recent pullback and the currently favorable USD/GBP exchange rate (I invest in GBP as a UK-based investor), I am considering doubling my position if the share price declines a further 2%. This would be a 1-3 years investment, with the intention of holding until the market has reflects impact of GTA VI in the share price.\n\nThis position currently represents roughly 1/25 of my portfolio, with the remainder allocated to more conservative investments such as Fidelity global dividend funds. Before doing so I wanted to ask the community whether increasing exposure to Take-Two at these levels is a reasonable strategy, or if this capital would be better invested elsewhere. Thanks!", "url": "https://www.reddit.com/gallery/1q302oa", "score": 40, "num_comments": 98, "upvote_ratio": 0.72, "author": "13rosasrojas", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q302oa/taketwo_interactive_discussion/", "flair": "Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2vldp", "window_s": 1800, "features": {"score_rate": 0.013422818791946308, "comment_rate": 0.0}, "trend_score": 0.013422818791946308, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2vldp", "created_utc": 1767449608, "subreddit": "wallstreetbets", "title": "Deutz Nutz - £20k position", "selftext": "Edited / reaubmitted to show 20k position.\n\nI reported a while back that Deutz is the play. Here is my updated analysis for you to lose granny's inheritance on.\n\n  \n**DEUTZ** is the boring German grandpa engine stock that woke up one morning and realised it now owns batteries, drone drives and backup power, but the market still values it like it only sells tractor parts🚜. This grandpa is quietly wiring itself into everything from electrified construction kit to military drone drives and decentralized generators, which means it gets paid whether the world is building roads or preparing for the next crisis. At the same time the German government is funnelling fresh NATO linked defence 🛰️ commitments into broader infrastructure and energy security projects🏗️ so a supplier of engines, gensets and electric drives🪫🔋 sits right in that money river. You are basically buying a slow talking Cologne uncle who just happens to own pick and shovel positions in defense, infrastructure and electrification while everyone else is still staring at shiny pure play defense charts. When the market finally realises this grandpa is not dying but compounding cash flows from multiple policy tailwinds the rerate writes itself. ", "url": "https://i.redd.it/q3bhh3e475bg1.png", "score": 58, "num_comments": 9, "upvote_ratio": 0.87, "author": "XunclericoX", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2vldp/deutz_nutz_20k_position/", "flair": "Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2qqpe", "window_s": 1800, "features": {"score_rate": 0.058823529411764705, "comment_rate": 0.0}, "trend_score": 0.058823529411764705, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2qqpe", "created_utc": 1767433769, "subreddit": "wallstreetbets", "title": "Made 28k in 161 Trades", "selftext": "", "url": "https://i.redd.it/8kmuy80pv3bg1.jpeg", "score": 92, "num_comments": 36, "upvote_ratio": 0.87, "author": "Schifty", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2qqpe/made_28k_in_161_trades/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q2357s", "window_s": 1800, "features": {"score_rate": 0.07352941176470588, "comment_rate": 0.0}, "trend_score": 0.07352941176470588, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2357s", "created_utc": 1767371415, "subreddit": "wallstreetbets", "title": "2025 returns: 47%, earning $6.8mm", "selftext": "2025 ended up being a pretty great year!\n\n47% return for $6,800,000\n\nA decent amount of gains are from selling options, and some great gains on being heavy long on RDDT and GOOG with shares and calls).\n\nAll in all, I typically have around 30 unique tickers and about 150 positions open at any given time. Those positions can be relatively small, up to hundreds of contracts. \n\nYes, lots of people had better returns in 2025. I’m trying to thread the needle of aggressive returns with sizable hedges. \n\nWith the market going up for 8 months straight, my hedges hurt quite a bit. But should a black swan event have occurred, or the market switched to bear mode, I would have done pretty well (especially compared to the market).\n\nHere’s to 2026 being a good one as well!", "url": "https://www.reddit.com/gallery/1q2357s", "score": 2044, "num_comments": 330, "upvote_ratio": 0.87, "author": "imacompnerd", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q2357s/2025_returns_47_earning_68mm/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q1zzaa", "window_s": 1800, "features": {"score_rate": 0.029411764705882353, "comment_rate": 0.0}, "trend_score": 0.029411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q1zzaa", "created_utc": 1767364078, "subreddit": "wallstreetbets", "title": "Tesla's quarterly deliveries fall more than expected on lower EV demand", "selftext": "", "url": "https://www.reuters.com/business/autos-transportation/teslas-quarterly-deliveries-fall-more-than-expected-lower-ev-demand-2026-01-02/", "score": 1568, "num_comments": 272, "upvote_ratio": 0.96, "author": "toydan", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q1zzaa/teslas_quarterly_deliveries_fall_more_than/", "flair": "News", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q213c5", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q213c5", "created_utc": 1767366770, "subreddit": "wallstreetbets", "title": "Long SLS @ $2.52 for $404,460, up $254,393 (+63%)", "selftext": "This post contains content not supported on old Reddit. [Click here to view the full post](https://sh.reddit.com/r/wallstreetbets/comments/1q213c5)", "url": "https://www.reddit.com/r/wallstreetbets/comments/1q213c5/long_sls_252_for_404460_up_254393_63/", "score": 1299, "num_comments": 293, "upvote_ratio": 0.95, "author": "Legym", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q213c5/long_sls_252_for_404460_up_254393_63/", "flair": "Verified Trade", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q27i9v", "window_s": 1800, "features": {"score_rate": 0.11764705882352941, "comment_rate": 0.0}, "trend_score": 0.11764705882352941, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q27i9v", "created_utc": 1767380872, "subreddit": "wallstreetbets", "title": "So glad I held.", "selftext": "Was down -10k in April I’m sure but was too scared to look", "url": "https://www.reddit.com/gallery/1q27i9v", "score": 300, "num_comments": 24, "upvote_ratio": 0.96, "author": "Mountain-Steak-544", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q27i9v/so_glad_i_held/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q1e0yk", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q1e0yk", "created_utc": 1767298961, "subreddit": "wallstreetbets", "title": "Naw it’s my turn. Next year 4 million", "selftext": "Only holding ASTS and RKLB. Started in 2024 buying them up around $4\n", "url": "https://i.redd.it/k3pr0x36rsag1.jpeg", "score": 8927, "num_comments": 668, "upvote_ratio": 0.92, "author": "foldyaup", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q1e0yk/naw_its_my_turn_next_year_4_million/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q19tl3", "window_s": 1800, "features": {"score_rate": 0.06711409395973154, "comment_rate": 0.0}, "trend_score": 0.06711409395973154, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q19tl3", "created_utc": 1767289013, "subreddit": "wallstreetbets", "title": "My Turn. Became a millionaire in 2025.", "selftext": "Long dated calls on tech stocks. Bought $150k of $GOOGL LEAPS in Aug 2025 when it was trading around $175. \n\nSince Aug 2024, my I’ve turned $4k into $1M through options 😤 ", "url": "https://www.reddit.com/gallery/1q19tl3", "score": 17828, "num_comments": 1102, "upvote_ratio": 0.92, "author": "iamyourcaviar", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q19tl3/my_turn_became_a_millionaire_in_2025/", "flair": "Gain", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q224yc", "window_s": 1800, "features": {"score_rate": 0.04411764705882353, "comment_rate": 0.0}, "trend_score": 0.04411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q224yc", "created_utc": 1767369173, "subreddit": "wallstreetbets", "title": "11.9k YOLO On bank America before they earning report", "selftext": "It gonna print after earnings or I’ll put the fries in the bag 💼 🍟 ", "url": "https://i.redd.it/wmw1x82yjyag1.jpeg", "score": 70, "num_comments": 52, "upvote_ratio": 0.89, "author": "Externox", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q224yc/119k_yolo_on_bank_america_before_they_earning/", "flair": "YOLO", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "wallstreetbets:1q22xy7", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q22xy7", "created_utc": 1767370969, "subreddit": "wallstreetbets", "title": "not even options losses", "selftext": "well i guess i picked the wrong stocks. if i break even in the next 2 years im going mutual funds now. im down 50k in total.", "url": "https://i.redd.it/v28twi93pyag1.png", "score": 23, "num_comments": 49, "upvote_ratio": 0.59, "author": "Odd_Surround4575", "permalink": "https://www.reddit.com/r/wallstreetbets/comments/1q22xy7/not_even_options_losses/", "flair": "Loss", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q33k1v", "window_s": 1800, "features": {"score_rate": 0.04411764705882353, "comment_rate": 0.0}, "trend_score": 0.04411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q33k1v", "created_utc": 1767468302, "subreddit": "stocks", "title": "With the US hitting Venezuela today, is anyone else terrified China takes Taiwan next? (and bricks the global chip supply)", "selftext": "Everyone is focused on Caracas right now, but I can’t stop thinking about the precedent this sets. If Beijing decides this is their green light to finally move on Taiwan, we aren’t looking at a chip shortage.\n\nPeople seem to forget the silicon shield failsafes. ASML has remote kill switches for their machines, and Taiwan has practically confirmed they would scorch-earth the TSMC foundries before letting the PLA take them intact.\n\nIf that happens, 90% of advanced chips don't just get expensive, they vanish. Overnight.\n\nWe’re talking about a total freeze on everything from new iPhones to Nvidia AI chips for at least 2-3 years while the US tries to spin up domestic fabs.\n\nWill the market even price this in? Feels like we are one bad decision away from the tech stone age.", "url": "https://www.reddit.com/r/stocks/comments/1q33k1v/with_the_us_hitting_venezuela_today_is_anyone/", "score": 3969, "num_comments": 1196, "upvote_ratio": 0.86, "author": "Orcanius", "permalink": "https://www.reddit.com/r/stocks/comments/1q33k1v/with_the_us_hitting_venezuela_today_is_anyone/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q3cmyi", "window_s": 1800, "features": {"score_rate": 0.14705882352941177, "comment_rate": 0.014705882352941176}, "trend_score": 0.17647058823529413, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q3cmyi", "created_utc": 1767490634, "subreddit": "stocks", "title": "What does Trump really want with Venezuela? Here are the Best Takes and stocks", "selftext": "We’ve all read the news, but what are Trumps real motivations. What do you guys think he wants?\n\n1. Flooding the global oil supply will lower prices, or more importantly, give Trump additional control over  the global economy through the oil supply. This may potentially be used as a bargaining chip (e.g. to weaken Iranian, Russian, Chinese economies, or to strengthen the dollar through Tariff style manipulation and leverage). Funds like USO and UCO will be interesting to watch - personally i’m staying away. \n\n2. Not only does Venezuela hold oil, but it also holds lots of gold. While Gold is currently trading at all time highs (and many economies like BRICS have been stocking up on reserves), Trump may wish to crash the gold price to ‘reinforce’ the safety of the dollar. Or, again, he may wish to leverage control. I am holding IAUM, but may sell some to resize. Again interesting to watch. \n\n3. Some have also speculated a digital currency backed by tangible (potentially Venezuelan) assets - I don’t really buy this but its interesting nonetheless.\n\n4. US grid capacity shortages have been noticeable and heavy generators are already being rolled out to fuel Data Centres and AI Infrastructure. As mentioned by Energy Secretary Chris Wright, ‘massive fleets of diesel and gas’ generators (35GW massive) may help to bridge the gap until renewable energy / grid upgrades materialise. It would cost a huge amount to buy that much fuel, if only I could get it for free… I think CAT is a miss for other reasons, but GNRC and CMI might be good plays given this background. \n\n5. All of this can be very damaging to China, as well as the fact that China has been ‘renting’ Venezuelan resources through loans granting them rights to gold, oil and rare earth materials. While I don’t think that the Rare Earths are particularly significant, snubbing China is still useful for Trump in terms of resources and ego. There may be a rise in the likes of USAR…\n\nPersonally I believe that the gold price and ETFs will start to plateau, and pending Trumps actions, maybe even fall.\n\nOil ETFs will probably remain fairly stable until Trump does something, although I believe that stocks such as HAL or CVX would be solid investments over the next two years.\n\nDid i miss anything?", "url": "https://www.reddit.com/r/stocks/comments/1q3cmyi/what_does_trump_really_want_with_venezuela_here/", "score": 974, "num_comments": 600, "upvote_ratio": 0.83, "author": "ahlornjtvn139", "permalink": "https://www.reddit.com/r/stocks/comments/1q3cmyi/what_does_trump_really_want_with_venezuela_here/", "flair": "Industry Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q2vxcc", "window_s": 1800, "features": {"score_rate": 0.11764705882352941, "comment_rate": 0.0}, "trend_score": 0.11764705882352941, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2vxcc", "created_utc": 1767450517, "subreddit": "stocks", "title": "With the news of U.S. opertation in Venezuela and capturing Maduro, how do you expect the market to react come Monday?", "selftext": "I was planning to close my investment account this week as I am in the process of buying a home and will need all of my money. But with this news today, I'm worried my investments will be in the red and it will hinder my home buying power. \n\nWhen the news was just the bombings I began to panic, but with the capture of Maduro I kind of feel more relaxed.\n\nWhat are your thoughts? How did a similar situation play out in the past?  ", "url": "https://www.reddit.com/r/stocks/comments/1q2vxcc/with_the_news_of_us_opertation_in_venezuela_and/", "score": 490, "num_comments": 579, "upvote_ratio": 0.82, "author": "KingOfLife", "permalink": "https://www.reddit.com/r/stocks/comments/1q2vxcc/with_the_news_of_us_opertation_in_venezuela_and/", "flair": "Industry Question", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q1ziog", "window_s": 1800, "features": {"score_rate": 0.08823529411764706, "comment_rate": 0.0}, "trend_score": 0.08823529411764706, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q1ziog", "created_utc": 1767362890, "subreddit": "stocks", "title": "Tesla reports 418,227 deliveries for the fourth quarter, down 16%", "selftext": "Tesla posted its fourth-quarter 2025 vehicle production and deliveries report on Friday.\n\nHere are the key numbers:\n\n* Total deliveries: 418,227\n* Total production: 434,358\n\nWall Street expected 426,000 deliveries for the quarter, according to estimates compiled by StreetAccount.\n\nIn a company-compiled consensus posted to its website on Dec. 29, Tesla said analysts it surveyed were expecting a 15% drop from a year earlier to 422,850 vehicles for the quarter.\n\nIn the fourth quarter of 2024, Elon Musk’s EV company reported 495,570 deliveries and production of 459,445 vehicles.\n\nTesla faces heightened competition in the electric vehicle market from China’s BYD, South Korea’s Kia and Hyundai, and Volkswagen in Europe.\n\nDeliveries are the closest approximation of sales reported by Tesla, but are not precisely defined in the company’s shareholder communications.\n\nIn its energy business, Tesla said that it deployed 14.2 gigawatt hours of battery energy storage products in the fourth quarter, following a record in the prior period, when it deployed 12.5 GWh.\n\nTesla’s battery energy storage systems include backup batteries for homes and larger systems used alongside data centers and utilities.\n\nSales of Tesla’s cars were impacted by President Donald Trump’s decision to end a federal EV incentive by Sept. 30, earlier than previously planned. The expiration pulled some EV sales forward to the third quarter for Tesla and other automakers.\n\nEven before that, the start of 2025 was a struggle for Tesla.\n\nAfter spending heavily to propel Trump back to the White House, Musk spent the first quarter of the year leading the president’s DOGE initiative to slash the federal workforce.\n\nMusk also endorsed Germany’s extremist anti-immigrant party, AfD, and later supported British anti-Muslim and anti-immigration activist Tommy Robinson. In recent weeks, Musk has called to abolish the European Union.\n\nPartly in response to Musk’s incendiary rhetoric, Tesla has faced an enduring consumer backlash in Europe and the U.S. The company hasn’t fully recovered despite introducing a new, more affordable version of its Model Y SUV in October.\n\nHowever, Tesla shares still rallied in the second half of the year, jumping 40% in the third quarter, reaching a fresh record in mid-December. Musk bought $1 billion worth of shares in September.\n\nShareholders approved a new $1 trillion pay plan for Musk in November that will give the CEO more shares and increased control over the company. The vote came after Musk threatened to potentially leave Tesla if the plan didn’t pass.\n\nCritics voiced concerns that the plan doesn’t require Musk to spend a minimum amount of time on his Tesla work, and that there are no limits on his political activity.\n\nWhile Tesla doesn’t break out deliveries geographically, data from the European Automobile Manufacturers’ Association (ACEA) showed that the company lost market share in the region in 2025.\n\nTesla’s European registrations fell 39% in the first 11 months of 2025, while Chinese rival BYD saw registrations rise 240% in Europe. Overall, battery electric vehicles were more widely embraced in Europe in 2025, amounting to around 16% of all new vehicles sold there.\n\nSome analysts project that sales of Tesla’s more affordable Model Y standard, which the company launched in October, will help the company regain ground in coming quarters.\n\nIn a note last week, analysts at Cannacord Genuity wrote that EV adoption “is rising quickly in emerging markets such as Thailand, Vietnam, and Brazil, where robust consumer interest could create meaningful long-term upside for Tesla, even as it faces fierce rivalry from Chinese automakers.”\n\nBesides BYD, Tesla now faces competition from other Chinese EV makers including Xiaomi and Geely.\n\nBut Tesla is selling investors on Musk’s vision of the future, or what he calls “sustainable abundance,” more than EV sales. That vision includes robotaxis, which Musk has promised for years, and humanoid robots, which he says will someday be able to serve as factory workers, babysitters, crime stoppers and surgeons.\n\nSource: [https://www.cnbc.com/2026/01/02/tesla-tsla-q4-2025-vehicle-deliveries.html](https://www.cnbc.com/2026/01/02/tesla-tsla-q4-2025-vehicle-deliveries.html)", "url": "https://www.reddit.com/r/stocks/comments/1q1ziog/tesla_reports_418227_deliveries_for_the_fourth/", "score": 1717, "num_comments": 319, "upvote_ratio": 0.97, "author": "Puginator", "permalink": "https://www.reddit.com/r/stocks/comments/1q1ziog/tesla_reports_418227_deliveries_for_the_fourth/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q39jku", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q39jku", "created_utc": 1767482636, "subreddit": "stocks", "title": "Euro hedged sp500", "selftext": "Basically the title. Since Trump wants to devalue the dollar. Would it not be better to be euro hedging the sp500 if i live in europe?\n\nWith everything going on in the world im a bit unsure to do right now. I know that in the long term this should even out (hopefully?). But yeah nowadays things are moving in all kinds of crazy directions. I’m not saying that the euro is a better currency than the dollar btw.", "url": "https://www.reddit.com/r/stocks/comments/1q39jku/euro_hedged_sp500/", "score": 2, "num_comments": 57, "upvote_ratio": 0.53, "author": "thd-ai", "permalink": "https://www.reddit.com/r/stocks/comments/1q39jku/euro_hedged_sp500/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q2z2cn", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q2z2cn", "created_utc": 1767458127, "subreddit": "stocks", "title": "Rate my picks", "selftext": "Ran a scan earlier in the week in hopes to find individual value stocks to buy and hold. Smallish exposure, goal is to have 25% of portfolio these picks and the other 75% VOO. \n\nScan criteria is as follows:\nReasonable share price vs book value (except MU, I’m willing to pay a higher ratio here for tech)\n\nMust haves:\nCurrent EPS growth higher than 5 yr avg\n\nPositive P/E\n\nCurrent revenue growth higher than 5 yr avg\n\nReturn on equity growth higher than 5 yr avg\n\n\nHere are the companies I’ve chosen so far:\n\nNBN - financial exposure with strong recent earnings growth and relatively low p/e compared to industry average.\n\nOHI - real estate exposure with strong EPS, Revenue, and ROE growth while staying at 5 yr P/E avg. I also firmly believe long term care will continue to have strong demand in the future.\n\nMU - tech exposure with absurd EPS, Revenue, and ROE growth. Current P/E of 27x is only about 2 times its 5 yr avg and is significantly lower than the industry average of 37-47x. I believe RAM is the bottleneck for AI development at the moment and MU is set up to benefit greatly as I believe it’s undervalued significantly.\n\nUHS - healthcare exposure, good earnings growth, low p/e. I think there’s still a stigma in the United States about mental health currently and opinions will change as people realize how important it is.\n\nI’m looking to add an Energy and Materials pick to this list in the near future. Let me know what you think!", "url": "https://www.reddit.com/r/stocks/comments/1q2z2cn/rate_my_picks/", "score": 4, "num_comments": 3, "upvote_ratio": 0.63, "author": "ipeench_", "permalink": "https://www.reddit.com/r/stocks/comments/1q2z2cn/rate_my_picks/", "flair": null, "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q232lw", "window_s": 1800, "features": {"score_rate": 0.08823529411764706, "comment_rate": 0.0}, "trend_score": 0.08823529411764706, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q232lw", "created_utc": 1767371257, "subreddit": "stocks", "title": "Tesla vs BYD", "selftext": "News today showing BYD has overtaken Tesla for the world’s largest EV carmaker in 2025. BYD sold 2.26m EVs vs Tesla’s 1.63m in the same period. \n\nWill we finally see the Tesla share price come down to reality with Chinese EV production continuing to ramp up and export to new countries?", "url": "https://www.reddit.com/r/stocks/comments/1q232lw/tesla_vs_byd/", "score": 87, "num_comments": 113, "upvote_ratio": 0.83, "author": "Key_Temporary_7059", "permalink": "https://www.reddit.com/r/stocks/comments/1q232lw/tesla_vs_byd/", "flair": "Company Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q26x1i", "window_s": 1800, "features": {"score_rate": 0.029411764705882353, "comment_rate": 0.0}, "trend_score": 0.029411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q26x1i", "created_utc": 1767379590, "subreddit": "stocks", "title": "Should I Invest in Walmart stock?", "selftext": "Hello everyone! For background, I am almost 19yo. I've been working at Walmart for a little over 6 months as a Pharmacy Technician while I pursue my undergraduate studies that will hopefully land me in pharmacy school. \n\nAs for my \"portfolio\" I have invested in VOO and NVDA through vanguard but no insane amount or anything contributed (roughly 1k).\n\nConsidering I haven't hit my 1 year anniversary, Walmart doesn't match my 401k yet but I have still been contributing 6%. \nContributions to date: $503\nCurrent balance: $475 (I guess that means it went down??)\n- Question 1 being: Should I wait to keep investing until they match?\n\n- Question 2: Should I invest in Walmart stocks through my associate app? If so should I do the max contribution? ($70 per paycheck for the max amount of matched contribution at 15% aka $10.50)\n\nOr am I overdoing it and need to just save this money in my high-yield towards college. (I am currently managing paying off my undergrad tuition just fine, but pharmacy school can be as much as 26k a year for 4 years)\n", "url": "https://www.reddit.com/r/stocks/comments/1q26x1i/should_i_invest_in_walmart_stock/", "score": 51, "num_comments": 43, "upvote_ratio": 0.8, "author": "Away-Friendship4882", "permalink": "https://www.reddit.com/r/stocks/comments/1q26x1i/should_i_invest_in_walmart_stock/", "flair": "Advice", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q14hbk", "window_s": 1800, "features": {"score_rate": 0.04411764705882353, "comment_rate": 0.0}, "trend_score": 0.04411764705882353, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q14hbk", "created_utc": 1767274957, "subreddit": "stocks", "title": "Reddit's 2026 Stock Picks", "selftext": "Here is the list for data from multiple posts and thousands of comments from r/stocks, r/wsb and r/investing from the various recommendation posts in the last 10 days. Data is optimized as best as I could to remove multiple recommendations from the same usernames as to not double count someone trying to pump certain stocks for some reason. Here's the list of top 30 recommendations ranked by # of mentions.\n\n* 1 RKLB\n* 2 ASTS\n* 3 AMZN\n* 4 NBIS\n* 5 GOOGL\n* 6 RDDT\n* 7 MU\n* 8 SOFI\n* 9 POET\n* 10 AMD\n* 11 IREN\n* 12 HOOD\n* 13 RIVN\n* 14 NVDA\n* 15 ONDS\n* 16 LUNR\n* 17 APLD\n* 18 TSLA\n* 19 PLTR\n* 20 META\n* 21 NVO\n* 22 AVGO\n* 23 PATH\n* 24 PL\n* 25 NFLX\n* 26 OPEN\n* 27 ANIC\n* 28 TMC\n* 29 FNMA\n* 30 UBER\n\nFor those that are interesting, the r/stocks specific list had HOOD and NVDA in the top 10 instead of POET and MU and had some slight differences at the end of the top 30 but in general, wasn't that much different.", "url": "https://www.reddit.com/r/stocks/comments/1q14hbk/reddits_2026_stock_picks/", "score": 1840, "num_comments": 398, "upvote_ratio": 0.97, "author": "timeinthemarket", "permalink": "https://www.reddit.com/r/stocks/comments/1q14hbk/reddits_2026_stock_picks/", "flair": "Meta", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
{"run_id": "run_1767564557", "candidate": {"key": "stocks:1q29sch", "window_s": 1800, "features": {"score_rate": 0.014705882352941176, "comment_rate": 0.0}, "trend_score": 0.014705882352941176, "reason": "rate_threshold", "snapshot": {"snapshot_ts": 1767564557, "post": {"id": "1q29sch", "created_utc": 1767386040, "subreddit": "stocks", "title": "$SMR up sharply today  looks more like a sector move than a company story", "selftext": "SMR (NuScale Power) is having a strong day, but unless I missed something, there’s no obvious company specific catalyst behind the move.\n\nThis looks more like a broader nuclear sector rotation than a sudden fundamental re rating of SMR itself.\n\nA few quick thoughts:\n\nThe nuclear theme keeps coming back  AI, data centers, and grid reliability all support the long term narrative.\n\nSMR is still early stage, with long timelines and real execution risk.\n\nHistorically, SMR tends to move fast when sentiment turns, and cool off just as quickly.\n\nNot saying today’s move is wrong  just that it feels sentiment driven rather than fundamentals driven.\n\nCurious how others here are thinking about it:\n\nLong nuclear as a long term infrastructure play, or just trading the volatility?\n\nIf you want exposure, do you prefer SMR, or broader plays like uranium miners / ETFs?\n\nInterested to hear different views.", "url": "https://www.reddit.com/r/stocks/comments/1q29sch/smr_up_sharply_today_looks_more_like_a_sector/", "score": 6, "num_comments": 5, "upvote_ratio": 0.87, "author": "One_Affectp", "permalink": "https://www.reddit.com/r/stocks/comments/1q29sch/smr_up_sharply_today_looks_more_like_a_sector/", "flair": "Industry Discussion", "is_crosspost": false}, "top_comments": []}}, "ts": 1767564614}
